Revit 2027 API
PDFExportOptions.ZoomPercentage Property
 Percentage of the zoom for the view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int ZoomPercentage { get; set; }
Public Property ZoomPercentage As Integer
	Get
	Set
public:
property int ZoomPercentage {
	int get ();
	void set (int value);
}
member ZoomPercentage : int with get, set
Property Value
Int32
Remarks
 This property would be ignored if the ZoomType is FitToPage.
See Also
Reference
PDFExportOptions Class
Autodesk.Revit.DB Namespace